## <font cor=yellow> Reformatação

In [432]:
import pandas as pd
import numpy as np

In [433]:
index = [('Rio de Janeiro', 2000), ('Rio de Janeiro', 2010),
         ('Recife', 2000), ('Recife', 2010),
         ('Fortaleza', 2000), ('Fortaleza', 2010),
         ('Porto Alegre', 2000), ('Porto Alegre', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561,
               21976457, 23378102]
pop = pd.Series(populations, index=index)
pop

(Rio de Janeiro, 2000)    33871648
(Rio de Janeiro, 2010)    37253956
(Recife, 2000)            18976457
(Recife, 2010)            19378102
(Fortaleza, 2000)         20851820
(Fortaleza, 2010)         25145561
(Porto Alegre, 2000)      21976457
(Porto Alegre, 2010)      23378102
dtype: int64

In [434]:
pop[('Rio de Janeiro', 2010):('Recife', 2000)]

(Rio de Janeiro, 2010)    37253956
(Recife, 2000)            18976457
dtype: int64

---

In [435]:
pop_multiindex = pd.Series([33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561,
               21976457, 23378102],
               index=[['Rio de Janeiro','Rio de Janeiro','Recife','Recife','Fortaleza','Fortaleza','Porto Alegre','Porto Alegre'],
                      [2000,2010,2000,2010,2000,2010,2000,2010]])

pop_multiindex

Rio de Janeiro  2000    33871648
                2010    37253956
Recife          2000    18976457
                2010    19378102
Fortaleza       2000    20851820
                2010    25145561
Porto Alegre    2000    21976457
                2010    23378102
dtype: int64

In [436]:
pop_multiindex.index

MultiIndex([('Rio de Janeiro', 2000),
            ('Rio de Janeiro', 2010),
            (        'Recife', 2000),
            (        'Recife', 2010),
            (     'Fortaleza', 2000),
            (     'Fortaleza', 2010),
            (  'Porto Alegre', 2000),
            (  'Porto Alegre', 2010)],
           )

In [437]:
pop_multiindex

Rio de Janeiro  2000    33871648
                2010    37253956
Recife          2000    18976457
                2010    19378102
Fortaleza       2000    20851820
                2010    25145561
Porto Alegre    2000    21976457
                2010    23378102
dtype: int64

In [438]:
pop_multiindex['Rio de Janeiro']

2000    33871648
2010    37253956
dtype: int64

In [439]:
pop_multiindex.loc[['Rio de Janeiro','Fortaleza']]

Rio de Janeiro  2000    33871648
                2010    37253956
Fortaleza       2000    20851820
                2010    25145561
dtype: int64

In [440]:
pop_multiindex

Rio de Janeiro  2000    33871648
                2010    37253956
Recife          2000    18976457
                2010    19378102
Fortaleza       2000    20851820
                2010    25145561
Porto Alegre    2000    21976457
                2010    23378102
dtype: int64

In [441]:
pop_multiindex.unstack()

                    2000      2010
Fortaleza       20851820  25145561
Porto Alegre    21976457  23378102
Recife          18976457  19378102
Rio de Janeiro  33871648  37253956

In [442]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                     index=[['Branca','Parda','Indigena','Preta'],[1,2,3,4]],
                     columns=[['Brasil', 'China', 'Espanha'], ['Verde', 'Vermelho', 'Verde']])
frame

           Brasil    China Espanha
            Verde Vermelho   Verde
Branca   1      0        1       2
Parda    2      3        4       5
Indigena 3      6        7       8
Preta    4      9       10      11

In [443]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['pais', 'cor']
frame

pais          Brasil    China Espanha
cor            Verde Vermelho   Verde
key1     key2
Branca   1         0        1       2
Parda    2         3        4       5
Indigena 3         6        7       8
Preta    4         9       10      11

In [444]:
frame['Brasil']

cor            Verde
key1     key2
Branca   1         0
Parda    2         3
Indigena 3         6
Preta    4         9

In [445]:
frame

pais          Brasil    China Espanha
cor            Verde Vermelho   Verde
key1     key2
Branca   1         0        1       2
Parda    2         3        4       5
Indigena 3         6        7       8
Preta    4         9       10      11

In [446]:
frame.swaplevel('key1','key2')

pais          Brasil    China Espanha
cor            Verde Vermelho   Verde
key2 key1
1    Branca        0        1       2
2    Parda         3        4       5
3    Indigena      6        7       8
4    Preta         9       10      11

In [447]:
frame.swaplevel(0,1).sort_index(level=0)

pais          Brasil    China Espanha
cor            Verde Vermelho   Verde
key2 key1
1    Branca        0        1       2
2    Parda         3        4       5
3    Indigena      6        7       8
4    Preta         9       10      11

### Estatísticas de resumo por níveis

In [448]:
frame

pais          Brasil    China Espanha
cor            Verde Vermelho   Verde
key1     key2
Branca   1         0        1       2
Parda    2         3        4       5
Indigena 3         6        7       8
Preta    4         9       10      11

In [449]:
frame.groupby(level='key2').sum()

pais Brasil    China Espanha
cor   Verde Vermelho   Verde
key2
1         0        1       2
2         3        4       5
3         6        7       8
4         9       10      11

In [450]:
frame.groupby(level='cor', axis=1).sum()

C:\Users\47131502023.1\AppData\Local\Temp\ipykernel_10916\2663900313.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  frame.groupby(level='cor', axis=1).sum()

cor            Verde  Vermelho
key1     key2
Branca   1         2         1
Parda    2         8         4
Indigena 3        14         7
Preta    4        20        10

### Indexando com as colunas de um DataFrame

In [451]:
frame = pd.DataFrame({'a': range(7),
                      'b': range(7, 0, -1),
                      'c': ['um', 'um', 'um', 'dois', 'dois', 'dois', 'dois'],
                      'd': [0,1,2,0,1,2,3]})
frame

   a  b     c  d
0  0  7    um  0
1  1  6    um  1
2  2  5    um  2
3  3  4  dois  0
4  4  3  dois  1
5  5  2  dois  2
6  6  1  dois  3

In [452]:
frame2 = frame.set_index(['c', 'd'])
frame2

        a  b
c    d
um   0  0  7
     1  1  6
     2  2  5
dois 0  3  4
     1  4  3
     2  5  2
     3  6  1

In [453]:
frame.set_index(['c','d'], drop=False)

        a  b     c  d
c    d
um   0  0  7    um  0
     1  1  6    um  1
     2  2  5    um  2
dois 0  3  4  dois  0
     1  4  3  dois  1
     2  5  2  dois  2
     3  6  1  dois  3

In [454]:
frame2

        a  b
c    d
um   0  0  7
     1  1  6
     2  2  5
dois 0  3  4
     1  4  3
     2  5  2
     3  6  1

In [455]:
frame2.reset_index(0)

      c  a  b
d
0    um  0  7
1    um  1  6
2    um  2  5
0  dois  3  4
1  dois  4  3
2  dois  5  2
3  dois  6  1

# <font color = 'red'> Atividades

### Formatando o cardápio
#### O QUE FAZER?
Criar um código com as especificações a seguir.
#### COMO FAZER?
1. Crie a seguinte estrutura com pandas;
2. Realize o unstack dessa estrutura em uma cópia;
3. Realize a troca de níveis em outra cópia2.

In [462]:
#Crie a seguinte estrutura com pandas:

index = [('Pizza', 'segunda'), ('Pizza', 'terça'),
         ('Torta', 'segunda'), ('Torta', 'terça'),
         ('Lasanha', 'segunda'), ('Lasanha', 'terça')]
populations = [35, 40,
               26, 32,
               48, 55]
comidas = pd.Series(populations, index=index)
comidas
index = pd.MultiIndex.from_tuples(index)
comidas = comidas.reindex(index)
comidas

Pizza    segunda    35
         terça      40
Torta    segunda    26
         terça      32
Lasanha  segunda    48
         terça      55
dtype: int64

In [456]:
# 1. Crie a seguinte estrutura com pandas;
card = pd.Series([35,40,26,32,48,55],
               index=[['Pizza','Pizza','Torta','Torta','Lasanha','Lasanha'],
                      ['segunda','terça','segunda','terça','segunda','terça']])

card

Pizza    segunda    35
         terça      40
Torta    segunda    26
         terça      32
Lasanha  segunda    48
         terça      55
dtype: int64

In [457]:
# 2. Realize o unstack dessa estrutura em uma cópia;
card1 = card.unstack()
card1

         segunda  terça
Lasanha       48     55
Pizza         35     40
Torta         26     32

In [458]:
# 3. Realize a troca de níveis em outra cópia2.
card2 = card.swaplevel(0,1)

# Atividade: Formatando o cardápio - 2


## O QUE FAZER?
Criar um código com as especificações a seguir.
#### COMO FAZER?
1. Crie a seguinte estrutura com pandas:
2. Resete o índice de todos os níveis da cópia2 feita em uma cópia3.
3. Coloque o nível 0 da cópia3 como índice e ordene para encontrar a solução final.

In [459]:
# 2. Resete o índice de todos os níveis da cópia2 feita em uma cópia3.
card3 = card2.reset_index()
card3

   level_0  level_1   0
0  segunda    Pizza  35
1    terça    Pizza  40
2  segunda    Torta  26
3    terça    Torta  32
4  segunda  Lasanha  48
5    terça  Lasanha  55

In [460]:
# 3. Coloque o nível 0 da cópia3 como índice e ordene para encontrar a solução final.
card3 = card3.set_index('level_0')
card3.sort_index()
card3

         level_1   0
level_0
segunda    Pizza  35
terça      Pizza  40
segunda    Torta  26
terça      Torta  32
segunda  Lasanha  48
terça    Lasanha  55